#Лаптев Илья 1
#start code
books = [{"title": "Я – Менгск","author":"Грэм Макнилл","year":"2010"},
         {"title":'Восхождение',"author":'Микки Нилсон',"year":"2000"},
         {"title":'Небесные дьяволы',"author":'Уильям К. Дитц',"year":"2010"},
         {"title":'Долги дьяволов',"author":'Грэм Макнилл',"year":"2011"},
         {"title":'Точка возгорания',"author":'Кейт Дж. Кавано',"year":"2001"}]
for i, book in enumerate(books):
    print (f"---------------------- Книга {i+1} -----------------------\n Название: {book['title']}, Автор: {book['author']},\n--------------------------{book['year']}-------------------------")
#end code